LOCK TABLES `data_platform_rank_text_data` WRITE;

INSERT INTO `data_platform_rank_text_data` (`RankType`, `Rank`, `Language`, `RankName`, `CreationDate`, `LastChangeDate`, `IsMarkedForDeletion`)
VALUES
	('PTAP', '1', 'JA', 'ビギナー', '2024-05-08', '2024-05-08', '0');
	('PTAP', '2', 'JA', '中級', '2024-05-08', '2024-05-08', '0');
	('PTAP', '3', 'JA', 'エキスパート', '2024-05-08', '2024-05-08', '0');
	('PTAP', '4', 'JA', 'マスター', '2024-05-08', '2024-05-08', '0');
	('PTAP', '5', 'JA', 'マニア', '2024-05-08', '2024-05-08', '0');
	('COMM', '1', 'JA', '友達', '2024-05-08', '2024-05-08', '0');
	('COMM', '2', 'JA', '仲良し', '2024-05-08', '2024-05-08', '0');
	('COMM', '3', 'JA', 'スーパー仲良し', '2024-05-08', '2024-05-08', '0');
	('COMM', '4', 'JA', '最高の友達', '2024-05-08', '2024-05-08', '0');
	('COMM', '5', 'JA', '神友', '2024-05-08', '2024-05-08', '0');
UNLOCK TABLES;
